
## Terraform plan for account: `prod`

**Commit:** f188bff2e73fe52a63fcdae1377fd46cd39a744c

### Plan summary

`3 to add, 2 to change, 0 to destroy`

**🆕 Creates**

```tf
module.environment-remote-state["prod"].module.dynamodb_state_lock_policy[0].aws_iam_policy.policy[0]
module.environment-remote-state["prod"].module.dynamodb_table.aws_dynamodb_table.this[0]
module.account.module.github[0].module.iam_github_oidc_readonly_role[0].aws_iam_role_policy_attachment.this["ProdDynamodbStateLock"]
```
**🔄 Updates**

```tf
module.account.module.github[0].module.iam_github_oidc_readonly_role[0].aws_iam_role.this[0]
module.account.module.github[0].module.iam_github_oidc_role[0].aws_iam_role.this[0]
```


----

<details data-gh-workflow="prod-account-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.environment-remote-state["prod"].module.dynamodb_state_lock_policy[0].aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow access to the Terraform state lock"
      + id               = (known after apply)
      + name             = "vol-app-146997448015-prod-terraform-state-lock-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
    }

  # module.environment-remote-state["prod"].module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "vol-app-146997448015-prod-terraform-state-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "vol-app-146997448015-prod-terraform-state-lock"
        }
      + tags_all         = {
          + "Name"       = "vol-app-146997448015-prod-terraform-state-lock"
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled        = false
            # (1 unchanged attribute hidden)
        }
    }

  # module.account.module.github[0].module.iam_github_oidc_readonly_role[0].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike                  = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:dvsa/vol-app:pull_request" -> [
                                  + "repo:dvsa/vol-app:pull_request",
                                  + "repo:dvsa/vol-app:pull_request",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "vol-app-github-actions-readonly-role"
        name                  = "vol-app-github-actions-readonly-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.account.module.github[0].module.iam_github_oidc_readonly_role[0].aws_iam_role_policy_attachment.this["ProdDynamodbStateLock"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "vol-app-github-actions-readonly-role"
    }

  # module.account.module.github[0].module.iam_github_oidc_role[0].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike                  = {
                              ~ "token.actions.githubusercontent.com:sub" = [
                                    "repo:dvsa/vol-app:ref:refs/heads/main",
                                  + "repo:dvsa/vol-app:ref:refs/heads/prerelease",
                                    "repo:dvsa/vol-app:environment:account-prod",
                                  - "repo:dvsa/vol-app:environment:prep",
                                    "repo:dvsa/vol-app:pull_request",
                                  - "repo:dvsa/vol-app:ref:refs/heads/prerelease",
                                  + "repo:dvsa/vol-app:environment:prep",
                                  + "repo:dvsa/vol-app:environment:prod",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "vol-app-github-actions-role"
        name                  = "vol-app-github-actions-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

```

</details>